---
kind: property
id: P:Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.NumberOfSolutions
source: html/519f72de-fbbb-9c70-23b6-ca925cb4fe6e.htm
---
# Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.NumberOfSolutions Property

The number of active solutions in routing solution mode.

## Syntax (C#)
```csharp
public int NumberOfSolutions { get; }
```